app/controllers/movies_controller.rb

  def search_directors
    @movie = Movie.find_by_id(params[:id])
    if @movie.director and @movie.director != ''
      @movies = Movie.where(:director => @movie.director)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ? LIMIT 1  [["director", "ABC"]]